import React from "react";

const Ipopup = () => {
    return (
        <div>
            <h1>이용약관</h1>
            <h2>제1조 (목적)</h2>
          <p>이 약관은 프로젝트 1팀(주)(이하 "회사")가 제공하는 프로젝트 1팀 게시판의 이용과 관련하여 "회사"와 "회원"의 권리, 의무 및 책임사항, 기타 필요한 사항을 규정함을 목적으로 합니다.</p>
          <h2>제2조 (용어의 정의)</h2>
          <p class="title_ol">이 약관에서 사용하는 용어의 정의는 다음과 같습니다. </p>
          <ol>
            <li>"웹 로그 분석서비스" 라 함은 회원이 등록한 웹사이트의 웹 로그를 분석한 데이터를 제공하는서비스인 프로젝트 1팀 게시판를 의미합니다. </li>
            <li>"회원"이라 함은 '프로젝트 1팀 이용약관'에 따라 "회사"와 이용계약을 체결하고 "회사"가 제공하는 서비스를 이용하는 회원 중, 이 약관에 동의하고 "웹 로그 분석서비스"를 이용하는 회원을 말합니다. </li>
            <li>이 약관에서 사용하는 용어 중 본 조에서 정하지 아니한 것은 서비스 별 안내, 프로젝트 1팀 이용약관, 관계 법령에서 정하는 바에 따르며 그 외에는 일반 관례에 따릅니다. </li>
          </ol>
          <h2>제3조 (약관의 게시와 개정) </h2>
          <ol>
            <li>"회사"는 이 약관의 내용을 "회원"이 쉽게 알 수 있도록 "웹 로그 분석서비스"의 시작 화면에 게시합니다. </li>
            <li>"회사"는 "약관의규제에관한법률", "정보통신망이용촉진및정보보호등에관한법률(이하 "정보통신망법")" 등 관련법을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다. </li>
            <li>"회사"가 약관을 개정할 경우에는 회원의 권리의무에 불리한 개정사항은 적용일 30일 이전에, 법률상 불리하지 않은 개정사항은 7일 이전에 적용일자 및 개정사유를 명시하여 현행약관과 함께 제1항의 방식에 따라 공지합니다. 다만, 회원에게 불리한 약관의 개정의 경우에는 공지 외에 일정기간 서비스 내 전자우편, 전자쪽지, 로그인 시 동의창 등의 전자적 수단 중 한가지 방법으로 통지합니다.</li>
            <li>불리한 약관 개정사항에 대하여 "회사"가 전항에 따라 개정 약관을 공지 또는 통지하면서 "회원"에게 상당기간 내에 의사표시를 하지 않으면 개정 약관에 동의하는 것으로 본다는 뜻을 명확하게 공지 및 통지한 경우에는 "회원"이 이에 명시적으로 의사표시 하지 않으면 "회원"이 개정약관에 동의한 것으로 봅니다.</li>
            <li>"회원"이 개정약관의 내용에 동의하지 않는 경우 “회원”은 이용계약을 해지할 수 있습니다.</li>
          </ol>
          <h2>제4조 (서비스의 이용)</h2>
          <ol>
            <li>"회원"은 누구든지 무상으로 "웹 로그 분석서비스"를 이용할 수 있습니다. </li>
            <li>"프로젝트 1팀 게시판"를 이용하고자 하는 "회원"은 이 약관의 내용에 대하여 동의하고, 분석하고자 하는 "회원"의 웹사이트의 URL 정보를 "회사"에 제공하고 등록절차를 마친 후 "회사"가 제공하는 정보 수집 코드를 "회원"의 웹사이트 내 페이지에 삽입함으로써 "웹 로그 분석서비스"를 이용할 수 있습니다. </li>
            <li>"회원" 은 자신의 권한과 책임 내에서 다른 "회원"을 지정하여, 회원계정에의 접근을 허여하고 관리 권한의 일부 또는 전부를 위임할 수 있습니다.</li>
            <li>"회원"은 "웹 로그 분석서비스" 시작 시 자신의 웹사이트 정보를 정확하게 입력하여야 합니다. </li>
          </ol>
          <h2>제5조 (서비스 이용에 의한 산출물의 보호 및 보유기간)</h2>
          <ol>
            <li>"회사"는 "회원"의 "웹 로그 분석서비스" 이용에 따른 웹사이트 등록정보, "웹 로그" 분석자료를(이하 "산출물"이라 한다;)을 "회원"의 동의 없이 제3자에게 제공할 수 없습니다. </li>
            <li>"회원"이 프로젝트 1팀 회원자격을 상실하는 경우 "회원"이 등록한 웹사이트의 웹로그 분석자료는 즉시 삭제될 수 있습니다. </li>
          </ol>
          <h2>제6조 (서비스 제공 내용 및 그 내용의 변경)</h2>
          <ol>
            <li>"회사"가 제공하는 "웹 로그 분석서비스"의 내용은, "웹 로그" 분석을 위한 정보 수집 코드의 제공과 정보 수집 코드를 이용하여 분석된 데이터의 제공으로 한정됩니다. </li>
            <li>"회사"가 제공하는 "웹 로그" 분석을 위한 스크립트를 "회원"의 웹사이트 내 페이지에 삽입하는 작업은 "웹 로그 분석서비스" 제공 내용에 포함되지 않습니다. </li>
            <li>"회사"는 상당한 이유가 있는 경우에 운영상, 기술상 필요에 따라 "웹 로그 분석서비스"의 전부 또는 일부를 변경할 수 있습니다. </li>
            <li>"회사"는 "웹 로그 분석서비스"의 내용, 이용방법, 이용시간 등에 대하여 변경이 있는 경우에는 변경사유, 변경될 내용 및 제공일자 등을 그 변경 전에 서비스 초기화면에 게시하여야 합니다. </li>
            <li>"회사"는 제3항의 서비스 변경에 관하여 관련법에 특별한 규정이 없는 한 "회원"에게 별도의 보상을 하지 않습니다. </li>
          </ol>
          <h2>제7조 (서비스의 중단)</h2>
          <ol>
            <li>"회사"는 무료로 제공되는 "웹 로그 분석서비스"의 전부 또는 일부를 "회사"의 정책, 운영상의 필요에 따라 중단할 수 있으며, 이 경우 회사는 "웹 로그 분석서비스" 초기 화면, 전자우편 등을 이용하여 서비스 중단 ( 30 )일 전에 관련 내용을 공지합니다. </li>
            <li>"회사"는 "회원"이 이 약관의 의무를 위반하거나 "웹 로그 분석서비스"의 정상적인 운영을 방해하는 경우, 경고, 일시정지, 영구이용중지 등으로 "회원"의 서비스 이용을 단계적으로 제한할 수 있습니다. </li>
            <li>"회사"는 무료로 제공되는 "웹 로그 분석서비스"의 전부 또는 일부의 중단에 관하여 관하여 관련법에 특별한 규정이 없는 한 "회원"에게 별도의 보상을 하지 않습니다. </li>
          </ol>
          <h2>제8조 (책임제한)</h2>
          <ol>
            <li>"회사"는 "웹 로그 분석서비스"를 통하여 제공한 정보 및 서비스의 정확성, 객관성에 대하여 보증하거나 책임지지 않습니다. </li>
            <li> "회원"이 이 약관 및 관계 법령을 위반한 경우, "회사"는 이로 인하여 발생한 결과에 대하여 책임지지 않습니다. </li>
            <li>제4조 제3항의 권한설정 기능을 통해 권한을 위임하거나 위임받은 "회원"간에 분쟁이 발생하는 경우 그로 인한 모든 책임은 "회원"에게 있습니다. "회사"는 귀책사유가 없는 한 책임을 지지 않습니다.</li>
          </ol>
          <h2>제9조 (약관 외 준칙)</h2>
          <p>이 약관에 명시되지 아니한 사항은 프로젝트 1팀 이용약관에 따르며, 프로젝트 1팀 이용약관과 이 약관의 내용이 상충되는 경우, 이 약관을 우선하여 적용합니다. </p>
          <h2>부칙</h2>
          <p>이 약관은 2021년 5 월 4 일부터 적용됩니다. </p>
          </div>
    )
}

export default Ipopup;